app/controllers/clients_controller.rb

SELECT `clients`.* FROM `clients`
---
  def index
    @clients = Client.all

INSERT INTO `clients` (`nickname`, `name`, `password`, `string`, `created_at`, `updated_at`) VALUES ('arga', 'Arnol Gutierrez', 'testo', '', '2016-12-29 21:28:47', '2016-12-29 21:28:47')
---
  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save

SELECT  `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1
---
    def set_client
      @client = Client.find(params[:id])