app/controllers/publicacion_controller.rb

SELECT `publicacions`.* FROM `publicacions`
---
  def index
    @publicaciones = Publicacion.all

INSERT INTO `publicacions` (`titulo`, `contenido`) VALUES ('Arga', 'LC')
---
  def create
    @publicacion = Publicacion.new(params[:publicacion].permit(:titulo, :contenido))
    @publicacion.save