app/controllers/usuarios_controller.rb

  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save
---
INSERT INTO `usuarios` (`name`, `nickname`, `password`, `secret_key`, `secret_iv`, `secret`, `created_at`, `updated_at`) VALUES ('Arnol', 'Gutiereres', 'es una', x'', x'', x'a569a1d1f609dd1fbc69a72e90964d0d', '2016-12-30 01:54:56', '2016-12-30 01:54:56')

    def set_usuario
      @usuario = Usuario.find(params[:id])
---
SELECT  `usuarios`.* FROM `usuarios` WHERE `usuarios`.`id` = 1 LIMIT 1